backend/app/controllers/api/v1/competitions_controller.rb

  def index
    @competitions = Competition.all
---
SELECT "competitions".* FROM "competitions"